# ----------------------------
# ========= Пример 1 =========
# ----------------------------
number = -1
if number < 0:
    raise ValueError("Число не может быть отрицательным")

# ----------------------------
# ========= Пример 2 =========
# ----------------------------
# while True:
#     try:
#         # Ввод числа пользователем
#         number = int(input("Введите положительное число: "))
#         if number < 0:
#             raise ValueError("Число не может быть отрицательным")
#         print(f"Вы ввели корректное число: {number}")
#         break  # Завершаем цикл, если число корректное
#     except ValueError as e:
#         # Обработка некорректного ввода
#         print(f"Ошибка: {e}. Попробуйте снова.")


# ----------------------------
# ========= Пример 3 =========
# ----------------------------
# def set_age(age: int) -> None:
#     if age < 0:
#         raise ValueError("Возраст не может быть отрицательным")
#     print(f"Возраст сохранён: {age}")


# try:
#     set_age(-5)
# except ValueError as e:
#     print(f"Ошибка: {e}")
